Repository: JoethonDev/christian_library
Catalog: backend/locale/*/LC_MESSAGES/django.po
Languages: ar

source: Bad Request
ar: طلب غير صحيح

source: The request could not be understood by the server.
ar: لم يتمكن الخادم من فهم الطلب.

source: Permission Denied
ar: تم رفض الإذن

source: You do not have permission to access this resource.
ar: ليس لديك الإذن للوصول إلى هذا المورد.

source: Page Not Found
ar: الصفحة غير موجودة

source: The page you are looking for could not be found.
ar: تعذر العثور على الصفحة التي تبحث عنها.

source: Internal Server Error
ar: خطأ داخلي في الخادم

source: An internal server error occurred. Please try again later.
ar: حدث خطأ داخلي في الخادم. الرجاء المحاولة مرة أخرى لاحقًا.

source: items
ar: عناصر

source: Content Items
ar: عناصر المحتوى

source: Basic Information
ar: المعلومات الأساسية

source: Description
ar: الوصف

source: System Information
ar: معلومات النظام

source: Title
ar: العنوان

source: Theology
ar: اللاهوت

source: Bible Study
ar: دراسة الكتاب المقدس

source: History
ar: التاريخ

source: Apologetics
ar: الدفاعيات

source: Christian Living
ar: الحياة المسيحية

source: Liturgy
ar: الطقوس

source: Category
ar: الفئة

source: Modules
ar: الوحدات

source: View Course
ar: عرض الدورة

source: Course URL
ar: رابط الدورة

source: Videos
ar: الفيديوهات

source: Audio Files
ar: ملفات الصوت

source: PDF Files
ar: ملفات PDF

source: Processing
ar: المعالجة

source: Error loading statistics
ar: خطأ في تحميل الإحصائيات

source: Statistics
ar: الإحصائيات

source: Activate selected courses
ar: تفعيل الدورات المختارة

source: Deactivate selected courses
ar: إلغاء تفعيل الدورات المختارة

source: Course export functionality will be implemented.
ar: سيتم تنفيذ وظيفة تصدير الدورات.

source: Export course data
ar: تصدير بيانات الدورة

source: Course
ar: الدورة

source: View Module
ar: عرض الوحدة

source: Module URL
ar: رابط الوحدة

source: Activate selected modules
ar: تفعيل الوحدات المختارة

source: Deactivate selected modules
ar: إلغاء تفعيل الوحدات المختارة

source: Module reordering functionality will be implemented.
ar: سيتم تنفيذ وظيفة إعادة ترتيب الوحدات.

source: Reorder modules
ar: إعادة ترتيب الوحدات

source: Name
ar: الاسم

source: Color
ar: اللون

source: Used in Content
ar: مستخدم في المحتوى

source: Activate selected tags
ar: تفعيل الوسوم المختارة

source: Deactivate selected tags
ar: إلغاء تفعيل الوسوم المختارة

source: Tag merging functionality will be implemented.
ar: سيتم تنفيذ وظيفة دمج الوسوم.

source: Merge selected tags
ar: دمج الوسوم المختارة

source: Arabic Title
ar: العنوان العربي

source: English Title
ar: العنوان الإنجليزي

source: Arabic Description
ar: الوصف العربي

source: English Description
ar: الوصف الإنجليزي

source: Slug
ar: الاسم اللطيف (Slug)

source: Active
ar: نشط

source: Created At
ar: تاريخ الإنشاء

source: Updated At
ar: تاريخ التحديث

source: Courses
ar: الدورات

source: Order
ar: الترتيب

source: Module
ar: الوحدة

source: Order must be a positive integer
ar: يجب أن يكون الترتيب عددًا صحيحًا موجبًا

source: Arabic Name
ar: الاسم العربي

source: English Name
ar: الاسم الإنجليزي

source: Hex color code (e.g., #8C1C13)
ar: رمز اللون السداسي (مثال: #8C1C13)

source: Tag
ar: الوسم

source: Tags
ar: الوسوم

source: Color must be a valid hex color code (e.g., #8C1C13)
ar: يجب أن يكون اللون رمزًا سداسيًا صحيحًا (مثال: #8C1C13)

source: Course not found
ar: لم يتم العثور على الدورة

source: Failed to retrieve courses
ar: فشل استرداد الدورات

source: Failed to retrieve course
ar: فشل استرداد الدورة

source: Failed to retrieve modules
ar: فشل استرداد الوحدات

source: Failed to retrieve module
ar: فشل استرداد الوحدة

source: Failed to retrieve categories
ar: فشل استرداد الفئات

source: Search failed
ar: فشل البحث

source: Arabic title is required
ar: العنوان العربي مطلوب

source: Please select a file to upload
ar: الرجاء اختيار ملف للتحميل

source: Invalid file type for selected content type
ar: نوع الملف غير صالح لنوع المحتوى المحدد

source: Invalid content type
ar: نوع محتوى غير صالح

source: Upload failed
ar: فشل التحميل

source: Content updated successfully
ar: تم تحديث المحتوى بنجاح

source: Update failed
ar: فشل التحديث

source: Content deleted successfully
ar: تم حذف المحتوى بنجاح

source: Failed to delete content
ar: فشل حذف المحتوى

source: Please select content items
ar: الرجاء اختيار عناصر المحتوى

source: Operation completed
ar: اكتملت العملية

source: items processed
ar: عناصر تمت معالجتها

source: items failed to process
ar: عناصر فشلت معالجتها

source: Bulk operation failed
ar: فشلت العملية الجماعية

source: Status updated successfully
ar: تم تحديث الحالة بنجاح

source: Error loading content
ar: خطأ في تحميل المحتوى

source: Content not found
ar: لم يتم العثور على المحتوى

source: Search temporarily unavailable
ar: البحث غير متاح مؤقتًا

source: Search error
ar: خطأ في البحث

source: Error loading dashboard
ar: خطأ في تحميل لوحة التحكم

source: Appearance
ar: المظهر

source: Status
ar: الحالة

source: Content Count
ar: عدد المحتويات

source: Unknown
ar: غير معروف

source: Duration
ar: المدة

source: File Size
ar: حجم الملف

source: Processing pending
ar: المعالجة معلقة

source: Currently processing
ar: قيد المعالجة حاليًا

source: Processing failed
ar: فشلت المعالجة

source: Not ready
ar: غير جاهز

source: HLS Status
ar: حالة HLS

source: Compressed
ar: مضغوط

source: Original only
ar: الأصلي فقط

source: Compression Status
ar: حالة الضغط

source: Bitrate
ar: معدل البت

source: Optimized
ar: مُحسَّن

source: Optimization Status
ar: حالة التحسين

source: Size
ar: الحجم

source: Pages
ar: الصفحات

source: File Information
ar: معلومات الملف

source: Classification
ar: التصنيف

source: Video
ar: فيديو

source: Audio
ar: صوت

source: PDF
ar: ملف PDF

source: Type
ar: النوع

source: No tags
ar: لا توجد وسوم

source: Pending
ar: معلق

source: Ready
ar: جاهز

source: Failed
ar: فشل

source: View Content
ar: عرض المحتوى

source: Content URL
ar: رابط المحتوى

source: Activate selected content
ar: تفعيل المحتوى المحدد

source: Deactivate selected content
ar: إلغاء تفعيل المحتوى المحدد

source: No items could be queued for reprocessing.
ar: لم يتم وضع أي عناصر في قائمة الانتظار لإعادة المعالجة.

source: Reprocess selected media
ar: إعادة معالجة الوسائط المختارة

source: Ready for Streaming
ar: جاهز للبث

source: Ready for Playback
ar: جاهز للتشغيل

source: Ready for Viewing
ar: جاهز للعرض

source: No module
ar: لا توجد وحدة

source: Content Type
ar: نوع المحتوى

source: Content Item
ar: عنصر المحتوى

source: Completed
ar: مكتمل

source: Original File
ar: الملف الأصلي

source: Duration (seconds)
ar: المدة (بالثواني)

source: HLS 720p Path
ar: مسار HLS 720p

source: HLS 480p Path
ar: مسار HLS 480p

source: Processing Status
ar: حالة المعالجة

source: File Size (MB)
ar: حجم الملف (ميجابايت)

source: Video Metadata
ar: بيانات تعريف الفيديو

source: Compressed File
ar: الملف المضغوط

source: Bitrate (kbps)
ar: معدل البت (كيلوبت/ثانية)

source: Audio Metadata
ar: بيانات تعريف الصوت

source: Optimized File
ar: الملف المحسّن

source: Page Count
ar: عدد الصفحات

source: PDF Metadata
ar: بيانات تعريف PDF

source: Video uploaded successfully and queued for processing
ar: تم تحميل الفيديو بنجاح ووضعه في قائمة انتظار المعالجة

source: Error uploading video
ar: خطأ في تحميل الفيديو

source: Audio uploaded and compressed successfully
ar: تم تحميل وضغط الملف الصوتي بنجاح

source: Error uploading audio
ar: خطأ في تحميل الملف الصوتي

source: PDF uploaded and compressed successfully
ar: تم تحميل وضغط ملف PDF بنجاح

source: Error uploading PDF
ar: خطأ في تحميل ملف PDF

source: Error deleting content
ar: خطأ في حذف المحتوى

source: Error creating content item
ar: خطأ في إنشاء عنصر المحتوى

source: Error updating content item
ar: خطأ في تحديث عنصر المحتوى

source: File size exceeds maximum allowed size
ar: يتجاوز حجم الملف الحد الأقصى المسموح به

source: File type not supported
ar: نوع الملف غير مدعوم

source: Invalid PDF file
ar: ملف PDF غير صالح

source: Video uploaded and queued for processing
ar: تم تحميل الفيديو ووضعه في قائمة انتظار المعالجة

source: Audio uploaded and queued for processing
ar: تم تحميل الملف الصوتي ووضعه في قائمة انتظار المعالجة

source: PDF uploaded and queued for processing
ar: تم تحميل ملف PDF ووضعه في قائمة انتظار المعالجة

source: Media file not available
ar: ملف الوسائط غير متاح

source: Content type mismatch
ar: عدم تطابق نوع المحتوى

source: Internal server error
ar: خطأ داخلي في الخادم

source: Invalid quality parameter
ar: معامل الجودة غير صالح

source: Video is not ready for streaming
ar: الفيديو غير جاهز للبث

source: Requested quality not available
ar: الجودة المطلوبة غير متاحة

source: Video not found
ar: لم يتم العثور على الفيديو

source: Authentication
ar: المصادقة

source: Personal Information
ar: المعلومات الشخصية

source: Permissions
ar: الصلاحيات

source: Important Dates
ar: تواريخ مهمة

source: Statistics & Management
ar: الإحصائيات والإدارة

source: Required Information
ar: المعلومات المطلوبة

source: Superuser
ar: مستخدم خارق (Superuser)

source: Staff
ar: الموظفين

source: Content Manager
ar: مدير المحتوى

source: Regular User
ar: مستخدم عادي

source: Role
ar: الدور

source: courses
ar: الدورات

source: modules
ar: الوحدات

source: content
ar: المحتوى

source: Content Statistics
ar: إحصائيات المحتوى

source: Member Since
ar: عضو منذ

source: Last Active
ar: آخر نشاط

source: Never
ar: أبداً

source: Content Created
ar: المحتوى المنشأ

source: Courses Managed
ar: الدورات المُدارة

source: Total Uploads
ar: إجمالي التحميلات

source: Detailed Statistics
ar: إحصائيات مفصلة

source: Manage Courses
ar: إدارة الدورات

source: Manage Content
ar: إدارة المحتوى

source: Content Management
ar: إدارة المحتوى

source: Content remains available.
ar: يبقى المحتوى متاحًا.

source: Activate selected users
ar: تفعيل المستخدمين المختارين

source: Deactivate selected users
ar: إلغاء تفعيل المستخدمين المختارين

source: Make content managers
ar: تعيين كمدراء محتوى

source: Remove content manager status
ar: إزالة حالة مدير المحتوى

source: Phone Number
ar: رقم الهاتف

source: Optional phone number for contact
ar: رقم هاتف اختياري للتواصل

source: Can this user manage content uploads and processing?
ar: هل يمكن لهذا المستخدم إدارة عمليات تحميل ومعالجة المحتوى؟

source: Arabic
ar: العربية

source: English
ar: الإنجليزية

source: Preferred Language
ar: اللغة المفضلة

source: User
ar: مستخدم

source: Users
ar: المستخدمون

source: Phone number must contain only digits, +, -, and spaces
ar: يجب أن يحتوي رقم الهاتف على أرقام فقط، وعلامات +، -، والمسافات

source: All required fields must be filled
ar: يجب ملء جميع الحقول المطلوبة

source: Passwords do not match
ar: كلمتا المرور غير متطابقتين

source: Password must be at least 8 characters long
ar: يجب أن تتكون كلمة المرور من 8 أحرف على الأقل

source: Username already exists
ar: اسم المستخدم موجود بالفعل

source: Email already exists
ar: البريد الإلكتروني موجود بالفعل

source: Registration failed. Please try again.
ar: فشل التسجيل. يرجى المحاولة مرة أخرى.

source: Password reset functionality will be implemented.
ar: سيتم تنفيذ وظيفة إعادة تعيين كلمة المرور.

source: Password reset confirmation will be implemented.
ar: سيتم تنفيذ تأكيد إعادة تعيين كلمة المرور.

source: Email already in use by another account
ar: البريد الإلكتروني مستخدم بالفعل من قبل حساب آخر

source: Profile updated successfully
ar: تم تحديث الملف الشخصي بنجاح

source: Failed to update profile
ar: فشل تحديث الملف الشخصي

source: Preferences functionality will be implemented.
ar: سيتم تنفيذ وظيفة التفضيلات.

source: Failed to retrieve profile
ar: فشل استرداد الملف الشخصي

source: Email already in use
ar: البريد الإلكتروني قيد الاستخدام بالفعل

source: Failed to retrieve content
ar: فشل استرداد المحتوى

source: Failed to retrieve statistics
ar: فشل استرداد الإحصائيات

source: Failed to retrieve preferences
ar: فشل استرداد التفضيلات

source: Preferences updated successfully
ar: تم تحديث التفضيلات بنجاح

source: Failed to update preferences
ar: فشل تحديث التفضيلات

source: An error occurred
ar: حدث خطأ

source: Resource not found
ar: المورد غير موجود

source: Permission denied
ar: تم رفض الإذن

source: Validation error
ar: خطأ في التحقق من الصحة

source: An unexpected error occurred
ar: حدث خطأ غير متوقع

source: Audio Manager
ar: إدارة الملفات الصوتية

source: Manage audio messages, sermons, and spiritual teachings
ar: إدارة الرسائل الصوتية والعظات والتعاليم الروحية

source: Add Audio
ar: إضافة ملف صوتي

source: Audio Content
ar: المحتوى الصوتي

source: Actions
ar: الإجراءات

source: No course assigned
ar: لم يتم تعيين دورة

source: Inactive
ar: غير نشط

source: Edit
ar: تعديل

source: Preview
ar: معاينة

source: No audio content found
ar: لم يتم العثور على محتوى صوتي

source: Start by uploading your first audio message
ar: ابدأ بتحميل أول رسالة صوتية لك

source: Bulk Operations
ar: العمليات الجماعية

source: Perform actions on multiple content items simultaneously
ar: تنفيذ إجراءات على عدة عناصر محتوى في وقت واحد

source: Important Warning
ar: تحذير هام

source: These operations affect multiple items and cannot be easily undone. Please proceed with caution.
ar: تؤثر هذه العمليات على عدة عناصر ولا يمكن التراجع عنها بسهولة. يرجى المتابعة بحذر.

source: Select Operation
ar: اختيار العملية

source: Activate
ar: تفعيل

source: Make content visible
ar: جعل المحتوى مرئيًا

source: Deactivate
ar: إلغاء التفعيل

source: Hide from public
ar: إخفاء عن الجمهور

source: Delete
ar: حذف

source: Permanently remove
ar: إزالة نهائيًا

source: Enter Content IDs
ar: إدخال معرفات المحتوى

source: Enter content IDs separated by commas or place each ID on a new line. You can find IDs in the content management table.
ar: أدخل معرفات المحتوى مفصولة بفواصل أو ضع كل معرف في سطر جديد. يمكنك العثور على المعرفات في جدول إدارة المحتوى.

source: Execute Bulk Operation
ar: تنفيذ العملية الجماعية

source: This action will be applied to all specified content items
ar: سيتم تطبيق هذا الإجراء على جميع عناصر المحتوى المحددة

source: Please select an operation first.
ar: الرجاء اختيار عملية أولاً.

source: Please enter at least one content ID.
ar: الرجاء إدخال معرف محتوى واحد على الأقل.

source: Are you sure you want to
ar: هل أنت متأكد من أنك تريد

source: content item(s)?
ar: عنصر (عناصر) محتوى؟

source: This action cannot be easily undone.
ar: لا يمكن التراجع عن هذا الإجراء بسهولة.

source: Delete Content?
ar: حذف المحتوى؟

source: Are you sure you want to permanently delete:
ar: هل أنت متأكد من أنك تريد حذف ما يلي نهائيًا:

source: This action cannot be undone and will permanently remove all associated files including thumbnails, processed versions, and metadata.
ar: لا يمكن التراجع عن هذا الإجراء وسيقوم بإزالة جميع الملفات المرتبطة نهائيًا بما في ذلك الصور المصغرة، والإصدارات المعالجة، والبيانات الوصفية.

source: Cancel
ar: إلغاء

source: Yes, Delete Permanently
ar: نعم، حذف نهائيًا

source: Content Details
ar: تفاصيل المحتوى

source: Edit and manage content metadata and settings
ar: تعديل وإدارة البيانات الوصفية والإعدادات الخاصة بالمحتوى

source: Edit Content Details
ar: تعديل تفاصيل المحتوى

source: Published
ar: منشور

source: Draft
ar: مسودة

source: Content Titles
ar: عناوين المحتوى

source: Content Descriptions
ar: أوصاف المحتوى

source: Content Settings
ar: إعدادات المحتوى

source: Comma Separated
ar: مفصولة بفواصل

source: Content is Active and Visible
ar: المحتوى نشط ومرئي

source: Toggle to publish or unpublish this content for users
ar: التبديل لنشر أو إلغاء نشر هذا المحتوى للمستخدمين

source: Save Changes
ar: حفظ التغييرات

source: Technical Metadata
ar: البيانات الوصفية الفنية

source: Content ID
ar: معرف المحتوى

source: Not available
ar: غير متاح

source: Danger Zone
ar: منطقة الخطر

source: Are you sure you want to delete this content?
ar: هل أنت متأكد من أنك تريد حذف هذا المحتوى؟

source: Delete Content
ar: حذف المحتوى

source: Manage your library's videos, audio messages, and documents
ar: إدارة فيديوهات مكتبتك، والرسائل الصوتية، والمستندات

source: Upload
ar: تحميل

source: Bulk
ar: جماعي

source: Search content by title, description, or ID...
ar: البحث عن المحتوى حسب العنوان أو الوصف أو المعرف...

source: All Types
ar: جميع الأنواع

source: Admin Dashboard
ar: لوحة تحكم المدير

source: Manage your Christian Library content and monitor system performance
ar: إدارة محتوى مكتبتك المسيحية ومراقبة أداء النظام

source: Upload Content
ar: تحميل المحتوى

source: Total Content
ar: إجمالي المحتوى

source: All Processed
ar: تمت معالجته بالكامل

source: Audio Messages
ar: الرسائل الصوتية

source: Books & PDFs
ar: الكتب وملفات PDF

source: Recent Uploads
ar: التحميلات الأخيرة

source: View All
ar: عرض الكل

source: Date
ar: التاريخ

source: No recent content
ar: لا يوجد محتوى حديث

source: Start by uploading your first content
ar: ابدأ بتحميل أول محتوى لك

source: Content
ar: المحتوى

source: No content found
ar: لم يتم العثور على محتوى

source: No content matches your current filters
ar: لا يوجد محتوى يطابق عوامل التصفية الحالية

source: Add Content
ar: إضافة محتوى

source: Showing
ar: عرض

source: of
ar: من

source: PDF Manager
ar: إدارة ملفات PDF

source: Manage books, documents, and sacred texts
ar: إدارة الكتب والمستندات والنصوص المقدسة

source: Add PDF
ar: إضافة ملف PDF

source: Document
ar: مستند

source: pages
ar: صفحات

source: Download
ar: تحميل

source: No file
ar: لا يوجد ملف

source: No PDF documents found
ar: لم يتم العثور على مستندات PDF

source: Start by uploading your first document
ar: ابدأ بتحميل أول مستند لك

source: System Monitor
ar: مراقب النظام

source: Monitor system performance, storage usage, and processing queues
ar: مراقبة أداء النظام، واستخدام التخزين، وقوائم انتظار المعالجة

source: Disk Usage
ar: استخدام القرص

source: Used
ar: المستخدم

source: Free
ar: المتاح

source: Original Files
ar: الملفات الأصلية

source: HLS Segments
ar: مقاطع HLS

source: Processing Queue
ar: قائمة انتظار المعالجة

source: Jobs Pending
ar: مهام معلقة

source: Jobs Failed
ar: مهام فاشلة

source: Background workers are currently processing content.
ar: تقوم عمال الخلفية بمعالجة المحتوى حاليًا.

source: Some processing jobs have failed. Please check the logs.
ar: فشلت بعض مهام المعالجة. يرجى التحقق من السجلات.

source: All systems running smoothly.
ar: جميع الأنظمة تعمل بسلاسة.

source: Upload New Content
ar: تحميل محتوى جديد

source: Add videos, audio messages, and documents to your library
ar: إضافة فيديوهات ورسائل صوتية ومستندات إلى مكتبتك

source: Select Content Type
ar: اختيار نوع المحتوى

source: Sermons & teachings
ar: عظات وتعاليم

source: Messages & podcasts
ar: رسائل وبودكاست

source: Upload File
ar: تحميل الملف

source: Drag & drop your file here
ar: اسحب وأفلت ملفك هنا

source: or click to browse
ar: أو انقر للتصفح

source: Supports MP4, AVI, MOV files (Max 2GB)
ar: يدعم ملفات MP4, AVI, MOV (الحد الأقصى 2 جيجابايت)

source: Supports MP3, WAV files (Max 100MB)
ar: يدعم ملفات MP3, WAV (الحد الأقصى 100 ميجابايت)

source: Supports PDF documents (Max 50MB)
ar: يدعم مستندات PDF (الحد الأقصى 50 ميجابايت)

source: Content Information
ar: معلومات المحتوى

source: Arabic Details
ar: التفاصيل باللغة العربية

source: Title (Arabic)
ar: العنوان (بالعربية)

source: Description (Arabic)
ar: الوصف (بالعربية)

source: English Details
ar: التفاصيل باللغة الإنجليزية

source: Title (English)
ar: العنوان (بالإنجليزية)

source: Description (English)
ar: الوصف (بالإنجليزية)

source: Tags & Categories
ar: الوسوم والفئات

source: e.g. liturgy, hymns, history (comma separated)
ar: على سبيل المثال: طقوس، ترانيم، تاريخ (مفصولة بفواصل)

source: Use commas to separate multiple tags. Tags will be created automatically if they don't exist.
ar: استخدم الفواصل لفصل الوسوم المتعددة. سيتم إنشاء الوسوم تلقائيًا إذا لم تكن موجودة.

source: Upload and Process Content
ar: تحميل ومعالجة المحتوى

source: Processing may take a few minutes depending on file size
ar: قد تستغرق المعالجة بضع دقائق حسب حجم الملف

source: Video Manager
ar: إدارة الفيديوهات

source: Manage video sermons, teachings, and spiritual content
ar: إدارة عظات الفيديو والتعاليم والمحتوى الروحي

source: Add Video
ar: إضافة فيديو

source: No videos found
ar: لم يتم العثور على فيديوهات

source: Christian Library
ar: المكتبة المسيحية

source: Uncategorized
ar: غير مصنف

source: Your browser does not support the audio element.
ar: متصفحك لا يدعم عنصر الصوت.

source: Audio file not available
ar: الملف الصوتي غير متاح

source: ago
ar: منذ

source: View
ar: عرض

source: Loading...
ar: جارٍ التحميل...

source: Loading PDF...
ar: جارٍ تحميل ملف PDF...

source: Error loading PDF
ar: خطأ في تحميل ملف PDF

source: Please try refreshing the page
ar: الرجاء محاولة تحديث الصفحة

source: PDF file not available
ar: ملف PDF غير متاح

source: This document has not been uploaded yet
ar: لم يتم تحميل هذا المستند بعد

source: Your browser does not support the video element.
ar: متصفحك لا يدعم عنصر الفيديو.

source: Video file not available
ar: ملف الفيديو غير متاح

source: This video has not been uploaded yet
ar: لم يتم تحميل هذا الفيديو بعد

source: Access Denied
ar: تم رفض الوصول

source: You do not have permission to view this page or resource.
ar: ليس لديك الإذن لعرض هذه الصفحة أو المورد.

source: You are currently logged in as
ar: أنت مسجل الدخول حاليًا باسم

source: Please log in to access this content.
ar: الرجاء تسجيل الدخول للوصول إلى هذا المحتوى.

source: Go Home
ar: الذهاب للصفحة الرئيسية

source: Login
ar: تسجيل الدخول

source: The page you are looking for might have been removed, had its name changed, or is temporarily unavailable.
ar: قد تكون الصفحة التي تبحث عنها قد أزيلت، أو تم تغيير اسمها، أو غير متاحة مؤقتًا.

source: Browse Library
ar: تصفح المكتبة

source: Back to Audio Library
ar: العودة إلى مكتبة الصوتيات

source: Download Audio
ar: تحميل الملف الصوتي

source: Loading audio player...
ar: جارٍ تحميل مشغل الصوت...

source: Transcript
ar: النص المكتوب

source: Notes
ar: ملاحظات

source: Audio Library
ar: مكتبة الصوتيات

source: Listen to inspiring sermons and spiritual messages
ar: استمع إلى العظات الملهمة والرسائل الروحية

source: Search audio messages...
ar: البحث في الرسائل الصوتية...

source: Latest
ar: الأحدث

source: Recently Added
ar: أُضيف مؤخراً

source: Featured
ar: المميز

source: Popular Messages
ar: الرسائل الشائعة

source: Playlists
ar: قوائم التشغيل

source: Organized Content
ar: محتوى منظم

source: Discover the Word of God through Videos, Audio, and Books
ar: اكتشف كلمة الله من خلال الفيديوهات، الصوتيات، والكتب

source: Search videos, audio, books...
ar: البحث في الفيديوهات، الصوتيات، الكتب...

source: Search
ar: بحث

source: Books
ar: الكتب

source: Latest Videos
ar: أحدث الفيديوهات

source: Recently added spiritual content
ar: المحتوى الروحي المُضاف مؤخراً

source: Latest Audio
ar: أحدث الصوتيات

source: Inspiring sermons and teachings
ar: عظات وتعاليم ملهمة

source: Recent Books
ar: الكتب الحديثة

source: Sacred texts and study materials
ar: نصوص مقدسة ومواد دراسية

source: Popular Categories
ar: الفئات الشائعة

source: Explore content by topics
ar: استكشف المحتوى حسب المواضيع

source: Explore
ar: استكشف

source: No Content Available
ar: لا يوجد محتوى متاح

source: Content will appear here once it's uploaded.
ar: سيظهر المحتوى هنا بمجرد تحميله.

source: No audio messages found
ar: لم يتم العثور على رسائل صوتية

source: Try adjusting your search terms or browse our categories
ar: حاول تعديل مصطلحات البحث أو تصفح فئاتنا

source: Browse Categories
ar: تصفح الفئات

source: Loading more audio...
ar: جارٍ تحميل المزيد من الصوتيات...

source: No documents found
ar: لم يتم العثور على مستندات

source: Loading more documents...
ar: جارٍ تحميل المزيد من المستندات...

source: No results found
ar: لم يتم العثور على نتائج

source: Try different keywords or browse our categories below
ar: جرب كلمات مفتاحية مختلفة أو تصفح فئاتنا أدناه

source: Loading more videos...
ar: جارٍ تحميل المزيد من الفيديوهات...

source: Back to Books
ar: العودة إلى الكتب

source: File not available
ar: الملف غير متاح

source: Loading PDF viewer...
ar: جارٍ تحميل عارض PDF...

source: Please wait while we prepare your document
ar: الرجاء الانتظار بينما نقوم بإعداد مستندك
