Repository: JoethonDev/christian_library
Catalog: backend/locale/*/LC_MESSAGES/django.po
Languages: ar

source: Summary
ar: ملخص

source: Table of Contents
ar: جدول المحتويات

source: Explore our collection of spiritual literature and sacred texts
ar: استكشف مجموعتنا من الأدب الروحي والنصوص المقدسة

source: Search books and documents...
ar: البحث في الكتب والمستندات...

source: Total Books
ar: إجمالي الكتب

source: Scripture
ar: الكتاب المقدس

source: Sacred Texts
ar: النصوص المقدسة

source: Devotionals
ar: العبادات اليومية

source: Daily Readings
ar: قراءات يومية

source: Downloads
ar: التحميلات

source: Available Offline
ar: متاح دون اتصال

source: Search Library
ar: البحث في المكتبة

source: Find videos, audio, books, and content by tags
ar: البحث عن الفيديوهات، الصوتيات، الكتب، والمحتوى حسب الوسوم

source: Enter your search query...
ar: أدخل استعلام البحث الخاص بك...

source: No results found for
ar: لم يتم العثور على نتائج لـ

source: Try different keywords or check spelling
ar: جرب كلمات مفتاحية مختلفة أو تحقق من التهجئة

source: Spiritual teachings
ar: تعاليم روحية

source: Sermons & talks
ar: عظات ومحادثات

source: Sacred texts
ar: نصوص مقدسة

source: Search Tips
ar: نصائح البحث

source: Use quotes for exact phrases
ar: استخدم علامات الاقتباس للعبارات المطابقة تماماً

source: Try different keywords
ar: جرب كلمات مفتاحية مختلفة

source: Search by topic or speaker
ar: ابحث حسب الموضوع أو المتحدث

source: Back to Videos
ar: العودة إلى الفيديوهات

source: views
ar: مشاهدات

source: Download Video
ar: تحميل الفيديو

source: Like
ar: إعجاب

source: Share
ar: مشاركة

source: Save
ar: حفظ

source: Loading video player...
ar: جارٍ تحميل مشغل الفيديو...

source: Related Videos
ar: فيديوهات ذات صلة

source: No related videos available
ar: لا تتوفر فيديوهات ذات صلة

source: Video Library
ar: مكتبة الفيديوهات

source: Spiritual teachings and sermons
ar: تعاليم وعظات روحية

source: Search Videos
ar: البحث في الفيديوهات

source: Search videos, topics, speakers...
ar: البحث في الفيديوهات، المواضيع، المتحدثين...

source: Filter by Tag
ar: تصفية حسب الوسم

source: All Tags
ar: جميع الوسوم

source: videos
ar: فيديوهات

source: Sharing the Word of God
ar: مشاركة كلمة الله

source: All rights reserved
ar: جميع الحقوق محفوظة

source: Home
ar: الرئيسية

source: Admin
ar: الإدارة

source: Admin Panel
ar: لوحة تحكم المدير

source: Dashboard
ar: لوحة التحكم

source: All Content
ar: جميع المحتوى

source: PDFs
ar: ملفات PDF

source: System
ar: النظام

source: Welcome Back
ar: مرحباً بعودتك

source: Your username and password didn't match. Please try again.
ar: اسم المستخدم وكلمة المرور غير متطابقين. الرجاء المحاولة مرة أخرى.

source: Username
ar: اسم المستخدم

source: Password
ar: كلمة المرور

source: Forgot password?
ar: هل نسيت كلمة المرور؟

source: Sign In
ar: تسجيل الدخول

source: Don't have an account?
ar: ليس لديك حساب؟

source: Register
ar: تسجيل

source: Reset Password
ar: إعادة تعيين كلمة المرور

source: Enter your email address and we will send you instructions to reset your password.
ar: أدخل عنوان بريدك الإلكتروني وسنرسل لك تعليمات لإعادة تعيين كلمة المرور الخاصة بك.

source: Email Address
ar: عنوان البريد الإلكتروني

source: Send Instructions
ar: إرسال التعليمات

source: Create Account
ar: إنشاء حساب

source: Join our community to save your favorite content.
ar: انضم إلى مجتمعنا لحفظ المحتوى المفضل لديك.

source: Already have an account?
ar: هل لديك حساب بالفعل؟

source: Profile Settings
ar: إعدادات الملف الشخصي

source: My Library
ar: مكتبتي

source: Edit Profile
ar: تعديل الملف الشخصي

source: First Name
ar: الاسم الأول

source: Last Name
ar: اسم العائلة

source: Email
ar: البريد الإلكتروني

source: Email cannot be changed.
ar: لا يمكن تغيير البريد الإلكتروني.

source: My Saved Content
ar: المحتوى المحفوظ لدي

source: Track your learning progress here.
ar: تتبع تقدمك التعليمي هنا.

source: You haven't saved any content yet.
ar: لم تقم بحفظ أي محتوى بعد.
